bierner.markdown-mermaid
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
github.vscode-github-actions
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
rust-lang.rust-analyzer
tamasfe.even-better-toml
yzhang.markdown-all-in-one
