# Aletheia Engineering System
# Canonical Brewfile
# Version 0.1

# ------------------------------------------------------------
# Core platform tools
# ------------------------------------------------------------

brew "git"
brew "gh"

# ------------------------------------------------------------
# Terminal and file utilities
# ------------------------------------------------------------

brew "wget"
brew "tree"
brew "jq"
brew "yq"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "fzf"
brew "htop"
brew "watch"
brew "just"

# ------------------------------------------------------------
# JavaScript / TypeScript / PWA toolchain
# ------------------------------------------------------------

brew "node"
brew "pnpm"

# ------------------------------------------------------------
# Python / data / automation toolchain
# ------------------------------------------------------------

brew "python"
brew "uv"

# ------------------------------------------------------------
# Rust toolchain manager
# ------------------------------------------------------------

brew "rustup-init"

# ------------------------------------------------------------
# Containers
# ------------------------------------------------------------

cask "docker"

# ------------------------------------------------------------
# Editor
# ------------------------------------------------------------

cask "visual-studio-code"

# ------------------------------------------------------------
# macOS productivity
# ------------------------------------------------------------

cask "raycast"

# ------------------------------------------------------------
# Browser testing
# ------------------------------------------------------------

cask "google-chrome"
cask "firefox"